Repository: CalvinTsangv1/Python_Website
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, es, pt, ru

source: List Groups
de: Liste Gruppen
es: Lista de Grupos
pt: Lista de Grupos
ru: Список группы

source: Contacts
de: Impressum
es: Contactos
pt: Contactos
ru: связи

source: Master Detail Groups
de: Master-Detail- Gruppen
es: Master Detail de Grupos
pt: Grupos tipo Master Detail
ru: Мастер Подробно Группы

source: List Contacts
de: Liste Kontakte
es: Lista de Contactos
pt: Lista de Contactos
ru: лист Контакты

source: Contacts Chart
de: Kontakte Tabelle
es: Gŕafico Contactos
pt: Gráfico de Contactos
ru: Контакты График

source: Contacts Birth Chart
de: Kontakte Geburtshoroskop
es: Gráfico de Contactos Nacimiento
pt: Gráfico de Contactos por Nascimento
ru: График Контакты рождения

source: Chart Data (Country)
de: Diagrammdaten (Land)
es: Gráfico de Datos ( País )
pt: Gráfico por país

source: Direct Chart Example
de: Direkter Tabelle Beispiel
es: Gráfico Ejemplo Directo
pt: Exemplo de gráfico directo

source: Master Detail Chart Example
de: Master -Detail -Diagramm Beispiel
es: Master Detail Gráfico Ejemplo
pt: Exemplo de gráfico Master Detail

source: Group By Chart Example
de: Gruppieren nach Diagramm Beispiel
es: Agrupar por Chart Ejemplo
pt: Exemplo de gráfico agrupado

source: Group By Pie Chart Example
de: Gruppieren nach Kreisdiagramm Beispiel
es: Agrupar por Pie Chart Ejemplo
pt: Exemplo de gráfico de queijo

source: Contact us with any questions you would like related with this project.
de: Kontaktieren Sie uns bei Fragen, die Sie gerne mit diesem Projekt verbundenen .
ru: Свяжитесь с нами по любым вопросам , которые вы хотели связанные с этим проектом .

source: Simple and rapid application development framework, built on top of Flask. includes detailed security, auto CRUD generation for your models, google charts and much more.
de: Einfache und schnelle Anwendungsentwicklung Rahmen , auf der Oberseite gebaut Flask. enthält detaillierte Sicherheit, Auto CRUD -Generierung für Ihre Modelle , google Charts und vieles mehr.
es: Marco de desarrollo de la aplicación simple y rápida , construido en la cima de la Frasco. Incluye seguridad detallada , generación CRUD auto para sus modelos google gráficos y mucho más.
pt: Framework de desenvolvimento simples e rápido, utilizando Flask. Inclui segurança granular, geração automática de CRUD a partir dos modelos de dados, Google charts e muito mais.
ru: Простой и быстрый фреймворк для разработки приложений , построенный на вершине Колбу. Включает в себя подробную безопасности, автогенерацией CRUD для ваших моделей , Google карты и многое другое.

source: Star it
de: Stern es
es: Estrellas
pt: Gosto
ru: Звезда его

source: Free and Open Source
de: Freie und Open Source
es: Libre y de Código Abierto
pt: Grátis e Código Aberto
ru: Свободное и открытое программное

source: Use it any way you like, it's free to use. Feel free to contribute, post questions, propose new features, report bugs. You can browse the code freely on github.
de: Verwenden Sie es, wie Sie wollen , es ist kostenlos zu benutzen
es: Úsalo como quieras, es de uso gratuito. Siéntase libre de contribuir, coloca preguntas, proponer nuevas características, informar de errores. Usted puede navegar por el códigoLibremente en github.
pt: Utilize da forma que bem entender, é livre. Esteja à vontade para contribuir, coloque questões, proponha novas funcionalidades, reporte bugs. Navegue pelo código à vontade no github.
ru: Используйте ее так, как вам нравится , это бесплатно для использования

source: Issues
de: Probleme
es: Cuestiones
pt: Questões
ru: Вопросы

source: Documentation
de: Dokumentation
es: Documentación
pt: Documentação
ru: документация

source: Every feature is documented with examples. API documentation is automatically generated from commented code.
de: Jede Funktion wird mit Beispielen dokumentiert. automatisch von kommentierten Code generiert.
es: Cada función se documenta con ejemplos. Documentación de la API es generada automáticamente de código comentado.
pt: Todas as funcionalidades e configurações estão documentadas com exemplos. A documentação da API é gerada automaticamente a partir de comentários no código.
ru: Каждая функция документирована с примерами автоматически генерируется из прокомментировал кода.

source: Login and get a hold on the quick how to example, with a simple contacts app. This will show the basic features of the framework. Feel free to login using user 'guest' password 'welcome'
de: Loggen Sie sich ein und erhalten Sie einen Halt auf dem schnellen , wie man beispielsweise mit einem einfachen KontakteApp . melden Sie sich mit Benutzer "guest" vergessen "welcome"
es: Inicia sesión y obtener una bodega en la rápida manera de ejemplo, con unos simples contactosaplicación. Esto le mostrará las características básicas de la estructura. Siéntase libre deinicio de sesión utilizando el usuario 'guest' 'welcome' password
pt: Entre e experimente um dos exemplos 'quick how to' da documentação, com uma aplicação simples de contactos. Ficará a conhecer as funcionalidades base da plataforma. Esteja à vontade para entrar com utilizador 'guest' password 'welcome'.
ru: Вход на конференцию и получить в руки на панели быстрого , как пример , с простыми контактовприложение . Войти с помощью пользователя 'guest' Пароль 'welcome'

source: Login
de: Anmelden
es: Inicio
pt: Entrar
ru: Войти

source: Super fast development
de: Super schnelle Entwicklung
es: Desarrollo rápido estupendo
pt: Desenvolvimento super rápido
ru: Супер быстрое развитие

source: Highly customizable
de: Sehr individuell
es: Altamente personalizable
pt: Altamente customizável
ru: Высоко настраиваемый

source: Automatic menu generation.
de: Automatische Menüerstellung.
es: Generación automática de menús.
pt: Geração automática de menus.
ru: Автоматическая генерация меню

source: Automatic CRUD generation.
de: Automatische CRUD Generation.
es: Generación automática CRUD.
pt: Geração automática de CRUD.
ru: Автоматическая генерация CRUD

source: Multiple actions on db records.
de: Mehrere Aktionen zu db records.
es: Múltiples acciones en registros db.
pt: Múltiplas ações sobre registos de bd.
ru: Несколько мероприятия по БД записей.

source: Big variety of filters for your lists.
de: Große Auswahl an Filtern für Ihre Listen.
es: Gran variedad de filtros para sus listas.
pt: Grande variadade de filtros para listas.
ru: Большой выбор фильтров для ваших списков.

source: Various view widgets: lists, master-detail, list of thumbnails etc
de: Verschiedene Widgets Ansicht : Listen, Master-Detail , Liste von Miniaturansichten usw.
es: Varios Vea los aparatos : listas, maestro-detalle , lista de miniaturas , etc.
pt: Vários widgets de visualização: listas, master-detail, listas de imagens etc.
ru: Различные виджеты вид : списки, мастер- деталь , список миниатюр и т.д.

source: Google charts with automatic group by or direct values and filters.
de: Google charts mit automatischer Gruppe oder direkte Werte und Filter.
es: Gráficos de Google con grupo automática o valores directos y filtros.
pt: Google charts com agrupamento automático ou de valores directos e filtros.
ru: Карты Google с автоматическим группы по или непосредственных значений и фильтров.

source: Ready to go Security
de: Ready to go Sicherheit
es: Listo para ir de Seguridad
pt: Segurança completa.
ru: Готовность к безопасности

source: Fully granular
de: voll körnige
es: Totalmente granular
pt: Completamente granular.
ru: Полностью гранулированный

source: Automatic permissions lookup, based on exposed methods.
de: Automatische Berechtigungen Lookup , basierend auf Methoden ausgesetzt.
es: Permisos automáticas de búsqueda , basado en métodos expuestos.
pt: Descoberta de permissões automáticas baseada em métodos expostos.
ru: Автоматические разрешений поиска , на основе открытых методов.

source: Inserts on the Database all the detailed permissions possible on your application.
de: Fügt auf der Datenbank alle detaillierten Berechtigungen möglich auf anwendung.
es: Inserta en la base de datos de todos los permisos detallados posible en su application
pt: Insere na base de dados todas as permissões possíveis da sua aplicação.
ru: Вставка в базе данных все подробные разрешения возможно на вашем

source: Public (no authentication needed) and Private permissions.
de: Öffentliche (keine Authentifizierung erforderlich) und privaten Berechtigungen.
es: Public (sin autenticación necesaria ) y permisos privados.
pt: Permissões públicas e privadas.
ru: Не Публичная ( проверка подлинности требуется) и частного права.

source: Role based permissions.
de: Rollenbasierte Zugriffsrechte.
es: Permisos basados ​​en funciones.
pt: Permissões baseadas em Roles.
ru: На основе разрешения роль.

source: Authentication support for OpenID, Database and LDAP.
de: Authentifizierung Unterstützung für OpenID , Datenbank und LDAP.
es: El soporte de autenticación para OpenID, Database and LDAP.
pt: Suporte de autenticação para OpenID, Database e LDAP.
ru: Поддержка аутентификации для OpenID, Database, LDAP.

source: Support for self user registration.
de: Hilfe zur Selbstbenutzerregistrierung.
es: Soporte para el inquilino usuario.
pt: Suporte para registo de utilizadores.
ru: Поддержка Самостоятельная регистрация пользователя.

source: Form Generation
de: Formularerstellung
es: Formulario de Generación
pt: Geração de formulários
ru: Форма поколения

source: With full control
de: Mit voller Kontrolle
es: Con el control total
pt: Controlo total
ru: С полным контролем

source: Automatic, Add, Edit and Show from Database Models.
de: Automatisch, Hinzufügen, Bearbeiten und vom Datenbankmodelle zeigen.
es: Automático , añadir, editar y mostrar de modelos de bases de datos.
pt: Adicionar, editar e mostrar gerados a partir dos modelos de dados.
ru: Автоматическая , добавлять, редактировать и шоу от моделей баз данных.

source: Labels and descriptions for each field.
de: Etiketten und Beschreibungen für jedes Feld.
es: Las etiquetas y descripciones de cada campo.
pt: Labels e descrição para cada campo.
ru: Этикетки и описания для каждого поля.

source: Automatic base validators from model's definition.
de: Automatische Basis Validatoren aus Definition Modells.
es: Automática de la base validadores de la definición de modelo.
pt: Validação automática dos dados a partir do modelo de dados.
ru: Автоматическая база валидаторов из определения модели.

source: Custom validators, extra fields, custom filters for related dropdown lists.
de: Eigene Prüfungen , zusätzliche Felder , benutzerdefinierte Filter für die entsprechenden Dropdown-lists.
es: Los validadores propios, campos adicionales, filtros personalizados para desplegable relacionado listas "
pt: Validação customizável, campos extra, filtros customizáveis para dropdown lists.
ru: Пользовательские валидаторы, дополнительные поля, пользовательские фильтры для соответствующего выпадающего списка списки.

source: Image and File support for upload and database field association
de: Bild und Datei Unterstützung für den Upload und Datenbankfeld Verband
es: Imagen y archivos de soporte para upload y el campo de base de datos de la asociación
pt: Suporte para imagens e ficheiros para upload.
ru: Изображение и поддержку файлов для загрузки и поля базы данных объединения

source: Field sets for Form's (Django style).
de: Field sets für Formen (Django style).
es: Field sets para las formas (Django style).
pt: Field sets para formulários (Django style).

source: Multi Language Support
de: Sprachunterstützung
es: Soporte de idiomas
pt: Suporte para traduções
ru: Языковая поддержка

source: and more
de: und vieles mehr
es: y mucho más
pt: e muito mais
ru: и многое другое

source: Framework translations and your app translations merge.
de: Rahmen Übersetzungen und Ihre app Übersetzungen verschmelzen.
es: Traducciones framework y sus traducciones de aplicaciones fusionan.
pt: Fusão das traduções da sua aplicação e da framework.
ru: Рамочные переводы и ваши переводы приложение сливаются.

source: App Builder is a simple and rapid application development framework. built on top of Flask. Featuring:
de: App Builder ist eine einfache und schnelle Anwendungsentwicklung Rahmen auf der Oberseite der Flask gebautnmit:
es: App Builder es un marco de desarrollo de aplicaciones simples y rápidos.construido en la cima de Flask. Con:
pt: App Builder é uma plataforma simples de desenvolvimento rápido. Construido utilizando Flask. Incluí;
ru: App Builder является простым и быстрым база разработки приложений.В ролях:

source: Strong and detailed security on mind.
de: Stark und detaillierte Sicherheits auf den Geist .
es: Seguridad sólida y detallada.
pt: Segurança forte e detalhada
ru: Сильный и подробный безопасности на уме .

source: Mobile first philosophy from bootstrap.
de: Mobil erste Philosophie von Bootstrap .
es: Filosofía principal móvil con bootstrap.
pt: Filosofia de mobile first, utilizando a plataforma Bootstrap.
ru: Мобильная первая философия от загрузки.

source: Database highly configurable web CRUD, forms, charts and much more.
de: Database hochgradig konfigurierbare Web- CRUD , Formulare , Tabellen und vieles mehr.
es: Base de datos altamente configurable CRUD web, formularios, cartas y mucho más.
pt: Geração das primitivas Web a partir de modelos de dados, altamente configurável. Formulários, gráficos e muito mais
ru: База данных настраиваемый веб CRUD , формы , схемы и многое другое.

source: Live Demo
pt: Demonstração
ru: Демо
